tests/load-testing/load.yml
config:
  target: "http://localhost:4000" # Node API backend URL
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warm up API"
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load for Jobs Matching Engine"
  plugins:
    expect: {}
scenarios:
  - name: "Fetch Profile and Matches"
    flow:
      - get:
          url: "/api/profile"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/jobs/matched"
          expect:
            - statusCode: 200